### Terraform plan for permanent
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNWMyYTYyNy05NTRiLTQ2MmEtYWI1NC04ZDM3N2RkZDNlMDM7b2JqZWN0SWQ9MWZjNWI5ZTgtZDljMy00MTc5LThiNmItNDkxZjE4MDFlMDFhO3N1YnNjcmlwdGlvbklkPWM1N2MyYTAyLTI5N2QtNGY2OC05NzliLTE5NjBkZjcyMjYyNzt0ZW5hbnRJZD1lNjdjMTU4OS00NzQ3LTRiNzMtYjdiYi1kYTFiNTY3ZWUxZjU=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = true
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "onlinestorecontainerregistry"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "onlinestore-permanent-rg"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.permanent will be created
  + resource "azurerm_resource_group" "permanent" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "onlinestore-permanent-rg"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @benchiverton, Action: `pull_request`, Working Directory: ``, Workflow: `Permanent - plan`*